In [8]:
import pandas as pd
import numpy as np
import json
from pymongo import MongoClient

In [9]:
client = MongoClient("mongodb+srv://axelbonneau:n2GyfDMtGb02M7n4@ehpad.rqwk5.mongodb.net/")
db = client["Ehpad"]
collection = db["base-emplacement"]

In [10]:
collection.count_documents({"capacity" : {"$gte" : 20}})

9639

In [11]:
# Compter le nombre de place en fonction du nom de l'etablissement

pd.DataFrame(collection.aggregate(
    [
        {"$group": {"_id": "$legal_status", "Place": {"$sum": "$capacity"}}},
        {"$sort" : {"Place" : -1}},
        {"$limit" : 10}
    ]
))

                  _id   Place
0              Public  381731
1  Privé non lucratif  217110
2    Privé commercial  143955
3                 NaN      15

In [16]:
pd.DataFrame(collection.aggregate(
    [
        {"$group": {
            "_id": "$coordinates.deptname",  # Regroupement par département
            "capacity": {"$sum": "$capacity"}  # Calcul de la capacité totale
        }},
        {"$project": {
            "Departement": "$_id",  # Renommage du champ "_id" en "Departement"
            "capacity": 1,  # Garder le champ "capacity"
            "_id": 0  # Supprimer le champ "_id"
        }}, 
        {"$sort" : {"capacity" : -1}}
    ]
))

    capacity            Departement
0      24959                   NORD
1      19665       BOUCHES-DU-RHONE
2      18353                GIRONDE
3      18218                  RHONE
4      16753       LOIRE-ATLANTIQUE
..       ...                    ...
95      1468             GUADELOUPE
96      1399  TERRITOIRE DE BELFORT
97      1070            HAUTE-CORSE
98       916           CORSE-DU-SUD
99       285                 GUYANE

[100 rows x 2 columns]

In [49]:
distinct_values = collection.distinct("coordinates.gestionnaire")
len(distinct_values)

6439

In [42]:
pd.DataFrame(collection.aggregate(
    [
        {"$group" : {"_id" : "$coordinates.deptname",
                     "Nombre moyen de place" : {"$avg":"$capacity"}}},
        {"$sort" : {"Nombre moyen de place" : -1}}, 
        {"$limit" :10}
    ]
))

                     _id  Nombre moyen de place
0  TERRITOIRE DE BELFORT              93.266667
1                  MARNE              87.883721
2                   EURE              87.275000
3                 ALLIER              83.742424
4                ARDECHE              82.025641
5         HAUTS-DE-SEINE              80.081395
6               YVELINES              79.865772
7           EURE-ET-LOIR              79.508475
8              FINISTERE              79.407643
9                 LOIRET              78.510417